{"_id":{"$oid":"62a90d3839dad42fb9c2becd"},"Title":"silence of the Lambs","Description":"The Silence of the Lambs is a 1991 film based on the book of the same name by Thomas Harris. It was the first \"scary movie\" to ever win an Academy Award.","Genre":{"Name":"Thriller","Description":"Thriller film, also known as suspense film or suspense thriller, is a broad film genre that involves exitement and suspense in the audience."},"Director":{"Name":"Jonathan Demme","Bio":"Robert Jonathan Demme was an American director, producer, and screenwriter.","Birth":"1944","Death":"2017"},"ImagePath":"silenceofthelambs.png","Featured":true}
{"_id":{"$oid":"62a92c342301127d006ae989"},"Title":"Batman: The Dark Knight","Description":"When the menace known as the Joker wreaks havoc and chaos on the people of Gotham, Batman must accept one of the greatest psychological and physical tests of his ability to fight injustice.","Genre":{"Name":"Action","Description":"fast-paced and include a lot of action like fight scenes, chase scenes, and slow-motion shots. They can feature superheroes, martial arts, or exciting stunts. These high-octane films are more about the execution of the plot rather than the plot itself."},"Director":{"Name":"Christopher Nolan","Bio":"Christopher Nolan is an American critically acclaimed writer-director.","Birth":"1970"},"Featured":true}
{"_id":{"$oid":"62a932ad1f7a50b4f1dc05ef"},"Title":"Inception","Description":"A thief who steals corporate secrets through the use of dream-sharing technology is given the inverse task of planting an idea into the mind of a C.E.O., but his tragic past may doom the project and his team to disaster.","Genre":{"Name":"Science-Fiction","Description":"a fictionalized story wherein the setting and plot are centered around technology, time travel, outer space, or scientific principles, with or without the presence of aliens. Story elements are not found in the known universe and explained by scientific means."},"Director":{"Name":"Christopher Nolan","Bio":"Christopher Nolan is an American Critically acclaimed writer-director.","Birth":"1970"}}
{"_id":{"$oid":"62a938fa6ab7d5c86da87394"},"Title":"Get Out","Description":"A young African-American visits his white girlfriend's parents for the weekend, where his simmering uneasiness about their reception of him eventually reaches a boiling point.","Genre":{"Name":"Thriller","Description":"Thrillers are dark, engrossing, and suspenseful plot-driven stories. They very seldom include comedic elements."},"Director":{"Name":"Jordan Peele","Bio":"Jordan Peele is an American actor, comedian and filmmaker.","Birth":"1979"}}
{"_id":{"$oid":"62a93a4e6ab7d5c86da87395"},"Title":"Interstellar","Description":"A team of explorers travel through a wormhole in space in an attempt to ensure humanity's survival.","Genre":{"Name":"Science-Fiction","Description":"a fictionalized story wherein the setting and plot are centered around technology, time travel, outer space, or scientific principles, with or without the presence of aliens. Story elements are not found in the known universe and explained by scientific means."},"Director":{"Name":"Christopher Nolan","Bio":"Christopher Nolan is an American critically acclaimed writer-director.","Birth":"1970"}}
{"_id":{"$oid":"62a93bfb6ab7d5c86da87396"},"Title":"Tenet","Description":"Armed with only one word, Tenet, and fighting for the survival of the entire world, a Protagonist journeys through a twilight world of international espionage on a mission that will unfold in something beyond real time.","Genre":{"Name":"Science-Fiction","Description":"a fictionalized story wherein the setting and plot are centered around technology, time travel, outer space, or scientific principles, with or without the presence of aliens. Story elements are not found in the known universe and explained by scientific means."},"Director":{"Name":"Christopher Nolan","Bio":"Christopher Nolan is an American critically acclaimed writer-director.","Birth":"1970"}}
{"_id":{"$oid":"62a93d606ab7d5c86da87397"},"Title":"Pineapple Express","Description":"A process server and his marijuana dealer wind up on the run from hitmen and a corrupt police officer after he witnesses his dealer's boss murder a competitor while trying to serve papers on him.","Genre":{"Name":"Comedy","Description":"Comedy is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect."},"Director":{"Name":"Judd Apatow","Bio":"Judd Apatow is an American producer, writer, director, actor and stand-up comedian.","Birth":"1967"}}
{"_id":{"$oid":"62a93e316ab7d5c86da87398"},"Title":"SuperBad","Description":"Two co-dependent high school seniors are forced to deal with separation anxiety after their plan to stage a booze-soaked party goes awry.","Genre":{"Name":"Comedy","Description":"Comedy is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect."},"Director":{"Name":"Judd Apatow","Bio":"Judd Apatow is an American producer, writer, director, actor and stand-up comedian.","Birth":"1967"}}
{"_id":{"$oid":"62a93fb76ab7d5c86da87399"},"Title":"Pulp Fiction","Description":"The lives of two mob hitmen, a boxer, a gangster and his wife, and a pair of diner bandits intertwine in four tales of violence and redemption.","Genre":{"Name":"Crime","Description":"Crime fiction, detective story, murder mystery, mystery novel, and police novel are terms used to describe narratives that centre on criminal acts and especially on the investigation, either by an amateur or a professional detective, of a serious crime, generally a murder."},"Director":{"Name":"Quentin Tarantino","Bio":"Quentin Tarantino is an American filmmaker, actor, film critic and author.","Birth":"1963"}}
{"_id":{"$oid":"62a941636ab7d5c86da8739a"},"Title":"Top Gun","Description":"As students at the United States Navy's elite fighter weapons school compete to be best in the class, one daring young pilot learns a few things from a civilian instructor that are not taught in the classroom.","Genre":{"Name":"Action","Description":"fast-paced and include a lot of action like fight scenes, chase scenes, and slow-motion shots. They can feature superheroes, martial arts, or exciting stunts. These high-octane films are more about the execution of the plot rather than the plot itself."},"Director":{"Name":"Tony Scott","Bio":"Tony Scott was a British film director and producer.","Birth":"1944","Death":"2012"}}
